import { Change } from "./index.js";

new Change("6.6.1", [
  "Опять накосячил с сайтом ахах"
]);

new Change("6.6.0", [
  "Релиз новой версии!",
  "Команда /abc, позволяющая переводить текст, написаный в английской расскладке (ghbdtn > привет)",
  "Небольшой редизайн сайта",
  "Множество технических изменений, благодаря которым бот ускорился на 20%",
  "Изменение приоритетов загрузки. Теперь первым загружается сайт, а не бот"
]);

new Change("6.5.26", [
  "Багофикс модуля OC",
  "Улучшение выводов лога и сообщений о старте/остановке/заморозке бота",
]);

new Change("6.5.25", [
  "Модуль ОС доделан, добавлена возможность отредактировать и удалить персонажа",
  "Я смог заруинить даже список изменений, поэтому да.",
]);

new Change("6.5.24", [
  "Добавлен модуль ОС!",
  "Пофикшен баг с групповым редактором текста",
  "Убрана ненужная команда /reg",
]);

new Change("6.5.20", [
  "Новый дизайн сайта!",
  "Начата разработка модуля OC",
  "Вследствие технических особенностей остановлнера разработка модуля GroupTitleAnimation",
  "Новый форматтер текста",
  "Много технических изменений",
]);

new Change("6.5.9", [
  "Команда /call <Message>",
  "Команда /pin с фиксированным временем",
  "Нормальный вывод ошибок и еще некоторые технические изменения",
]);

new Change("6.5.5", [
  "Список изменений теперь изменяется",
  "Бот должен стабильнее работать",
  "Добавлены форматеры текста",
]);

new Change("6.2.12", ["Добавлен список изменений"]);
