import { Change } from "./index.js";

new Change('7.1.0', ['Команда /google', "Фикс подсказок", 'Обновление описания'])

new Change('7.0.7', ['Фикс критической ошибки'])

new Change('7.0.6', ['Системный багофикс'])

new Change('7.0.5', ['Багофикс'])

new Change("7.0.4", [
  "Разработка многих фич",
]);

new Change("7.0.3", [
  "Админ меню",
]);

new Change("7.0.2", [
  "Завершение работы над модулем управления/вывода сообщений.",
]);


new Change("7.0.1", [
  "Фикс критической ошибки",
]);

new Change(
  "7.0.0",
  [
    "Теперь при запуске бота сообщения и нажатия на кнопки обрабатываются быстрее",
    "Багофикс",
    "Небольшой редизайн сайта",
  ],
  "Улучшение запуска бота и отсутствие багов побудили меня назвать эту версию релизом."
);

new Change("6.6.6", [
  "Улучшение вывода ошибок и других системных сообщений",
  "Оптимизация",
]);

new Change("6.6.5", [
  "Теперь редактирование ОС работает стабильно",
  "Улучшение вывода ошибок и других системных сообщений",
  "Оптимизация",
]);

new Change("6.6.4", [
  "Фикс багов команды /call",
  "Улучшение переходов в модуле OC",
  "Улучшение вывода ошибок и других системных сообщений",
  "Оптимизация",
]);

new Change("6.6.4", [
  "Множество изменений модуля команд",
  "Оптимизация",
  "Команда консоли $sudo",
  "Улучшение вывода ошибок и других системных сообщений",
]);

new Change("6.6.1", ["Фикс сайта, потому что опять накосячил ахах"]);

new Change("6.6.0", [
  "Релиз новой версии!",
  "Команда /abc, позволяющая переводить текст, написаный в английской расскладке (ghbdtn > привет)",
  "Небольшой редизайн сайта",
  "Множество технических изменений, благодаря которым бот ускорился на 20%",
  "Изменение приоритетов загрузки. Теперь первым загружается сайт, а не бот",
]);

new Change("6.5.26", [
  "Багофикс модуля OC",
  "Улучшение выводов лога и сообщений о старте/остановке/заморозке бота",
]);

new Change("6.5.25", [
  "Модуль ОС доделан, добавлена возможность отредактировать и удалить персонажа",
  "Я смог заруинить даже список изменений, поэтому да.",
]);

new Change("6.5.24", [
  "Добавлен модуль ОС!",
  "Пофикшен баг с групповым редактором текста",
  "Убрана ненужная команда /reg",
]);

new Change("6.5.20", [
  "Новый дизайн сайта!",
  "Начата разработка модуля OC",
  "Вследствие технических особенностей остановлнера разработка модуля GroupTitleAnimation",
  "Новый форматтер текста",
  "Много технических изменений",
]);

new Change("6.5.9", [
  "Команда /call <Message>",
  "Команда /pin с фиксированным временем",
  "Нормальный вывод ошибок и еще некоторые технические изменения",
]);

new Change("6.5.5", [
  "Список изменений теперь изменяется",
  "Бот должен стабильнее работать",
  "Добавлены форматеры текста",
]);

new Change("6.2.12", ["Добавлен список изменений"]);
